part-1.org
  #+Title: Clojure School
  #+Author: Likely
  #+Email: 

#+REVEAL_EXTRA_CSS: css/zenburn.css
#+REVEAL_THEME: solarized
#+OPTIONS: num:nil toc:nil reveal_mathjax:t
#+REVEAL_TRANS: fade

* Welcome
* Introductions

- Henry Garner (CTO, Likely)

- James Henderson (Senior Developer, Likely)


Professionally using Clojure for 18 months

* Who are you?

... and what are you hoping to get out of these sessions?

* What we'll cover today
  
  - Getting up and running
  - Language primitives
  - Working with sequences
  - Working with higher order functions
  - Working with real data
  - Moving beyond the REPL

* Where will we get to in 4 weeks?
  
  - The ability to create your own non-trivial Clojure projects

* Housekeeping
  - Experience of LISP?
  - Other functional languages?
  - What text editor?
  - Who has Java?
  - Who has leiningen?

* Getting Set Up

First, you’ll need a Java Virtual Machine, or JVM, and its associated development tools, called the JDK. This is the software which runs a Clojure program. If you’re on Windows, install Oracle JDK 1.7. If you’re on OS X or Linux, you may already have a JDK installed. In a terminal, try:

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
which javac
  </code></pre>
  #+END_HTML

If you see something like

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
/usr/bin/javac
  </code></pre>
  #+END_HTML

Then you're good to go

Windows users: http://leiningen.org/#install

* Leiningen

#+BEGIN_SRC bash
mkdir -p ~/bin
cd ~/bin
curl -O https://raw.github.com/technomancy/leiningen/stable/bin/lein
chmod a+x lein
#+END_SRC

#+BEGIN_SRC bash
cd
lein new scratch
#+END_SRC

#+BEGIN_SRC bash
export PATH="$PATH":~/bin
#+END_SRC

* REPL

#+BEGIN_SRC bash
lein repl
#+END_SRC

This is an interactive Clojure environment called a REPL, for “Read, Evaluate, Print Loop”. It’s going to read a program we enter, run that program, and print the results. REPLs give you quick feedback, so they’re a great way to explore a program interactively, run tests, and prototype new ideas.

* REPL

With most languages, you write the system from the outside.

With LISPs, you bring the system up and develop it from the inside.

* Jumping inside

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> nil
nil
  </code></pre>
  #+END_HTML

nil is the most basic value in Clojure.

* Boolean values

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> true
true
user=> false
false
  </code></pre>
  #+END_HTML

* Basic Types

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
0
-42
1.2e-5
1/3

"Hi there!"

\space
\E

:keywords

#"\d+"
  </code></pre>
  #+END_HTML

* Collection Types

Maps
  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
{:a 1 :b 2}
  </code></pre>
  #+END_HTML

Sets
  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
#{1 2 3}
  </code></pre>
  #+END_HTML

Vectors
  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
[1 2 3]
  </code></pre>
  #+END_HTML

... that's it!

"It is better to have 100 functions operate on one data structure than 10 functions on 10 data structures." —Alan Perlis

* Def

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> (def x 3)
#'user/x
  </code></pre>
  #+END_HTML

We've defined a var in the 'user' namespace and can refer to it:

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> x
3
  </code></pre>
  #+END_HTML

* Lists

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> (1 2 3)
ClassCastException java.lang.Long cannot be cast to clojure.lang.IFn 
  user/eval146 (NO_SOURCE_FILE:1)
  </code></pre>
  #+END_HTML

* Wha happen?

The REPL sees a list and treats it as a function invocation.

The first element in the list is always the function to be invoked, with any remaining elements passed as arguments.

* Function Invocation

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> (inc 0)
1

user=> (inc x)
4
  </code></pre>
  #+END_HTML

* Nesting
  #+BEGIN_HTML
  <pre>
Increment
  increment
    the number 
  </pre>
  #+END_HTML
  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> (inc (inc 0))
2
  </code></pre>
  #+END_HTML

* Evaluation

Every list starts with a verb. Parts of a list are evaluated from left to right. Innermost lists are evaluated before outer lists.

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
(+ 1 (- 5 2) (+ 3 4))
(+ 1 3       (+ 3 4))
(+ 1 3       7)
11
  </code></pre>
  #+END_HTML

* Control structures:

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> (if (> 3 2) "Higher" "Lower")
"Higher"

user=> (when (< 3 2) "Lower")
nil

user=> (when (> 3 2)
        (println "3 is greater than 2")
	"Higher")
3 is greater than 2
"Higher"
  </code></pre>
  #+END_HTML

See also: `if-not` and `when-not`

* More conditionals

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> (case (inc 3)
         3 "Uh oh"
         4 "Yep!"
         "Not so sure...")
"Yep!"

user=> (cond
         (= 4 (inc 2)) "(inc 2) is 4"
         (= 4 (/ 8 2)) "Cond picks the first correct case"
	 (zero? (- (* 4 2) 8) "This is true, but we won't get here"
         :otherwise "None of the above."
"Cond picks the first correct case"
  </code></pre>
  #+END_HTML

See also: condp

* Having fn yet?
  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> (fn [x] (+ x 1))

#<user$eval149$fn__150 user$eval149$fn__150@397d812b>
  </code></pre>
  #+END_HTML

We've created a function!

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> (fn [x]
         (if (even? x)
           (inc x)
           (dec x)))

#<user$eval149$fn__150 user$eval149$fn__150@397d812c>
  </code></pre>
  #+END_HTML
* Usage

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> ((fn [x] (+ x 1)) 10)
11
  </code></pre>
  #+END_HTML
You probably won't see this in production code...

* Defn

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> (def half
         (fn [number]
            (/ number 2)))

#'user/half

user=> (half 6)
3
  </code></pre>
  #+END_HTML

Creating a function and binding it to a var is so common that it has its own form: defn, short for def fn.

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> (defn half [number]
          (/ number 2))
#'user/half
  </code></pre>
  #+END_HTML

* Function Arity

Functions don’t have to take an argument. We’ve seen functions which take zero arguments, like (+).

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> (defn half [] 1/2)
#'user/half
user=> (half)
1/2
  </code></pre>
  #+END_HTML

But if we try to use our earlier form with one argument, Clojure complains that the arity–the number of arguments to the function–is incorrect.

  #+BEGIN_HTML
  <pre><code data-trim class="clojure">
user=> (half 10)
  
ArityException Wrong number of args (1) passed to:
  user$half  clojure.lang.AFn.throwArity (AFn.java:437)
  </code></pre>
  #+END_HTML

