part-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>(Clojure School)</title>
<meta name="author" content="(Likely)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.min.css"/>
<link rel="stylesheet" href="./reveal.js/css/theme/solarized.css" id="theme"/>
<link rel="stylesheet" href="css/zenburn.css"/>
<link rel="stylesheet" href="./reveal.js/css/print/pdf.css" type="text/css" media="print"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>Clojure School</h1>
<h2>Likely</h2>
<h2><a href="mailto:"></a></h2>
<h2></h2></section>

<section>
<section id="sec-1" >

<h2>Welcome</h2>
</section>
</section>
<section>
<section id="sec-2" >

<h2>Introductions</h2>
<ul class="org-ul">
<li>Henry Garner (CTO, Likely)
</li>

<li>James Henderson (Senior Developer, Likely)
</li>
</ul>


<p>
Professionally using Clojure for 18 months
</p>
</section>
</section>
<section>
<section id="sec-3" >

<h2>Who are you?</h2>
<p>
&#x2026; and what are you hoping to get out of these sessions?
</p>
</section>
</section>
<section>
<section id="sec-4" >

<h2>What we'll cover today</h2>
<ul class="org-ul">
<li>Getting up and running
</li>
<li>Language primitives
</li>
<li>Working with sequences
</li>
<li>Working with higher order functions
</li>
<li>Working with real data
</li>
<li>Moving beyond the REPL
</li>
</ul>
</section>
</section>
<section>
<section id="sec-5" >

<h2>Where will we get to in 4 weeks?</h2>
<ul class="org-ul">
<li>The ability to create your own non-trivial Clojure projects
</li>
</ul>
</section>
</section>
<section>
<section id="sec-6" >

<h2>Housekeeping</h2>
<ul class="org-ul">
<li>Experience of LISP?
</li>
<li>Other functional languages?
</li>
<li>What text editor?
</li>
<li>Who has Java?
</li>
<li>Who has leiningen?
</li>
</ul>
</section>
</section>
<section>
<section id="sec-7" >

<h2>Getting Set Up</h2>
<p>
First, you’ll need a Java Virtual Machine, or JVM, and its associated development tools, called the JDK. This is the software which runs a Clojure program. If you’re on Windows, install Oracle JDK 1.7. If you’re on OS X or Linux, you may already have a JDK installed. In a terminal, try:
</p>

  <pre><code data-trim class="clojure">
which javac
  </code></pre>

<p>
If you see something like
</p>

  <pre><code data-trim class="clojure">
/usr/bin/javac
  </code></pre>

<p>
Then you're good to go
</p>

<p>
Windows users: <a href="http://leiningen.org/#install">http://leiningen.org/#install</a>
</p>
</section>
</section>
<section>
<section id="sec-8" >

<h2>Leiningen</h2>
<div class="org-src-container">

<pre class="src src-bash">mkdir -p ~/bin
cd ~/bin
curl -O https://raw.github.com/technomancy/leiningen/stable/bin/lein
chmod a+x lein
</pre>
</div>

<div class="org-src-container">

<pre class="src src-bash">cd
lein new scratch
</pre>
</div>

<div class="org-src-container">

<pre class="src src-bash">export PATH="$PATH":~/bin
</pre>
</div>
</section>
</section>
<section>
<section id="sec-9" >

<h2>REPL</h2>
<div class="org-src-container">

<pre class="src src-bash">lein repl
</pre>
</div>

<p>
This is an interactive Clojure environment called a REPL, for “Read, Evaluate, Print Loop”. It’s going to read a program we enter, run that program, and print the results. REPLs give you quick feedback, so they’re a great way to explore a program interactively, run tests, and prototype new ideas.
</p>
</section>
</section>
<section>
<section id="sec-10" >

<h2>REPL</h2>
<p>
With most languages, you write the system from the outside.
</p>

<p>
With LISPs, you bring the system up and develop it from the inside.
</p>
</section>
</section>
<section>
<section id="sec-11" >

<h2>Jumping inside</h2>
  <pre><code data-trim class="clojure">
user=> nil
nil
  </code></pre>

<p>
nil is the most basic value in Clojure.
</p>
</section>
</section>
<section>
<section id="sec-12" >

<h2>Boolean values</h2>
  <pre><code data-trim class="clojure">
user=> true
true
user=> false
false
  </code></pre>
</section>
</section>
<section>
<section id="sec-13" >

<h2>Basic Types</h2>
  <pre><code data-trim class="clojure">
0
-42
1.2e-5
1/3

"Hi there!"

\space
\E

:keywords

#"\d+"
  </code></pre>
</section>
</section>
<section>
<section id="sec-14" >

<h2>Collection Types</h2>
<p>
Maps
</p>
  <pre><code data-trim class="clojure">
{:a 1 :b 2}
  </code></pre>

<p>
Sets
</p>
  <pre><code data-trim class="clojure">
#{1 2 3}
  </code></pre>

<p>
Vectors
</p>
  <pre><code data-trim class="clojure">
[1 2 3]
  </code></pre>

<p>
&#x2026; that's it!
</p>

<p>
"It is better to have 100 functions operate on one data structure than 10 functions on 10 data structures." —Alan Perlis
</p>
</section>
</section>
<section>
<section id="sec-15" >

<h2>Def</h2>
  <pre><code data-trim class="clojure">
user=> (def x 3)
#'user/x
  </code></pre>

<p>
We've defined a var in the 'user' namespace and can refer to it:
</p>

  <pre><code data-trim class="clojure">
user=> x
3
  </code></pre>
</section>
</section>
<section>
<section id="sec-16" >

<h2>Lists</h2>
  <pre><code data-trim class="clojure">
user=> (1 2 3)
ClassCastException java.lang.Long cannot be cast to clojure.lang.IFn 
  user/eval146 (NO_SOURCE_FILE:1)
  </code></pre>
</section>
</section>
<section>
<section id="sec-17" >

<h2>Wha happen?</h2>
<p>
The REPL sees a list and treats it as a function invocation.
</p>

<p>
The first element in the list is always the function to be invoked, with any remaining elements passed as arguments.
</p>
</section>
</section>
<section>
<section id="sec-18" >

<h2>Function Invocation</h2>
  <pre><code data-trim class="clojure">
user=> (inc 0)
1

user=> (inc x)
4
  </code></pre>
</section>
</section>
<section>
<section id="sec-19" >

<h2>Nesting</h2>
  <pre>
Increment
  increment
    the number 
  </pre>
  <pre><code data-trim class="clojure">
user=> (inc (inc 0))
2
  </code></pre>
</section>
</section>
<section>
<section id="sec-20" >

<h2>Evaluation</h2>
<p>
Every list starts with a verb. Parts of a list are evaluated from left to right. Innermost lists are evaluated before outer lists.
</p>

  <pre><code data-trim class="clojure">
(+ 1 (- 5 2) (+ 3 4))
(+ 1 3       (+ 3 4))
(+ 1 3       7)
11
  </code></pre>
</section>
</section>
<section>
<section id="sec-21" >

<h2>Control structures:</h2>
  <pre><code data-trim class="clojure">
user=> (if (> 3 2) "Higher" "Lower")
"Higher"

user=> (when (< 3 2) "Lower")
nil

user=> (when (> 3 2)
        (println "3 is greater than 2")
        "Higher")
3 is greater than 2
"Higher"
  </code></pre>

<p>
See also: `if-not` and `when-not`
</p>
</section>
</section>
<section>
<section id="sec-22" >

<h2>More conditionals</h2>
  <pre><code data-trim class="clojure">
user=> (case (inc 3)
         3 "Uh oh"
         4 "Yep!"
         "Not so sure...")
"Yep!"

user=> (cond
         (= 4 (inc 2)) "(inc 2) is 4"
         (= 4 (/ 8 2)) "Cond picks the first correct case"
         (zero? (- (* 4 2) 8) "This is true, but we won't get here"
         :otherwise "None of the above."
"Cond picks the first correct case"
  </code></pre>

<p>
See also: condp
</p>
</section>
</section>
<section>
<section id="sec-23" >

<h2>Having fn yet?</h2>
  <pre><code data-trim class="clojure">
user=> (fn [x] (+ x 1))

#<user$eval149$fn__150 user$eval149$fn__150@397d812b>
  </code></pre>

<p>
We've created a function!
</p>

  <pre><code data-trim class="clojure">
user=> (fn [x]
         (if (even? x)
           (inc x)
           (dec x)))

#<user$eval149$fn__150 user$eval149$fn__150@397d812c>
  </code></pre>
</section>

</section>
<section>
<section id="sec-24" >

<h2>Usage</h2>
  <pre><code data-trim class="clojure">
user=> ((fn [x] (+ x 1)) 10)
11
  </code></pre>
<p>
You probably won't see this in production code&#x2026;
</p>
</section>
</section>
<section>
<section id="sec-25" >

<h2>Defn</h2>
  <pre><code data-trim class="clojure">
user=> (def half
         (fn [number]
            (/ number 2)))

#'user/half

user=> (half 6)
3
  </code></pre>

<p>
Creating a function and binding it to a var is so common that it has its own form: defn, short for def fn.
</p>

  <pre><code data-trim class="clojure">
user=> (defn half [number]
          (/ number 2))
#'user/half
  </code></pre>
</section>
</section>
<section>
<section id="sec-26" >

<h2>Function Arity</h2>
<p>
Functions don’t have to take an argument. We’ve seen functions which take zero arguments, like (+).
</p>

  <pre><code data-trim class="clojure">
user=> (defn half [] 1/2)
#'user/half
user=> (half)
1/2
  </code></pre>

<p>
But if we try to use our earlier form with one argument, Clojure complains that the arity–the number of arguments to the function–is incorrect.
</p>

  <pre><code data-trim class="clojure">
user=> (half 10)
  
ArityException Wrong number of args (1) passed to:
  user$half  clojure.lang.AFn.throwArity (AFn.java:437)
  </code></pre>
</section>
</section>
