part-1.html
<section>
<section id="sec-27" >

<h2>Multiple Arities</h2>
<p>
To handle multiple arities, functions have an alternate form. Instead of an argument vector and a body, one provides a series of lists, each of which starts with an argument vector, followed by the body.
</p>

  <pre><code data-trim class="clojure">
user=> (defn half
         ([]  1/2)
         ([x] (/ x 2)))

#'user/half

user=> (half)
1/2

user=> (half 10)
5
  </code></pre>
</section>
</section>
<section>
<section id="sec-28" >

<h2>Variable Arities</h2>
<p>
Some functions can take any number of arguments. For that, Clojure provides &amp;, which slurps up all remaining arguments as a list:
</p>
  <pre><code data-trim class="clojure">
user=> (defn vargs
         [x y & more-args]
         {:x    x
          :y    y
          :more more-args})
#'user/vargs

user=> (vargs 1)

ArityException Wrong number of args (1) passed to: user$vargs 
clojure.lang.AFn.throwArity (AFn.java:437)

user=> (vargs 1 2)
{:x 1, :y 2, :more nil}

user=> (vargs 1 2 3 4 5)
{:x 1, :y 2, :more (3 4 5)}
  </code></pre>
</section>

</section>
<section>
<section id="sec-29" >

<h2>Bindings</h2>
<p>
We know that symbols are names for things, and that when evaluated, Clojure replaces those symbols with their corresponding values.
</p>

  <pre><code data-trim class="clojure">
user=> +
#<core$_PLUS_ clojure.core$_PLUS_@12992c>
  </code></pre>

<p>
We can create names which are locally scoped.
</p>

  <pre><code data-trim class="clojure">
user=> (let [cats 5]
          (str "I have " cats " cats."))
"I have 5 cats."
  </code></pre>
</section>

</section>
<section>
<section id="sec-30" >

<h2>Bindings are local</h2>
<p>
Let bindings apply only within the let expression itself. They also override any existing definitions for symbols at that point in the program. For instance, we can redefine addition to mean subtraction, for the duration of a let:
</p>

  <pre><code data-trim class="clojure">
user=> (let [+ -]
         (+ 2 3))
-1
  </code></pre>
<p>
But that definition doesn’t apply outside the let:
</p>

  <pre><code data-trim class="clojure">
user=> (+ 2 3)
5 
  </code></pre>
</section>
</section>
<section>
<section id="sec-31" >

<h2>Bindings can be composed</h2>
<p>
We can also provide multiple bindings. Since Clojure doesn’t care about spacing, alignment, or newlines, I’ll write this on multiple lines for clarity.
</p>

  <pre><code data-trim class="clojure">
user=> (let [person   "joseph"
             num-cats 186]
         (str person " has " num-cats " cats!"))
"joseph has 186 cats!"
  </code></pre>
<p>
When multiple bindings are given, they are evaluated in order. Later bindings can use previous bindings.
</p>

  <pre><code data-trim class="clojure">
user=> (let [cats 3
             legs (* 4 cats)]
         (str legs " legs all together"))
"12 legs all together"
  </code></pre>
</section>

</section>
<section>
<section id="sec-32" >

<h2>Keywords as functions</h2>
  <pre><code data-trim class="clojure">
user=> (def my-map {:a 1 :b 2})
#'user/my-map

user=> (:a my-map)
1
  </code></pre>
</section>

</section>
<section>
<section id="sec-33" >

<h2>Destructuring</h2>
  <pre><code data-trim class="clojure">
user=> (def my-map {:a 1 :b 2 :c [3 4 5]})
#'user/my-map

user=> (let [a (:a my-map)
             b (:b my-map)]
         (+ a b))
3

user=> (let [{a :a b :b} my-map]
         (+ a b))
3

user=> (let [{:keys [a b]} my-map]
         (+ a b))
3
  </code></pre>
</section>

</section>
<section>
<section id="sec-34" >

<h2>Nested Destructuring</h2>
  <pre><code data-trim class="clojure">
user=> (let [{:keys [c]} my-map
             [c1 c2 c3] c]
         (+ c1 c2 c3))
12

user=> (let [{[c1 c2 c3] :c} my-map]
         (+ c1 c2 c3))
12

  </code></pre>
</section>

</section>
<section>
<section id="sec-35" >

<h2>A brief tour of clojure.core</h2>
<p>
Working with maps:
</p>

  <pre><code data-trim class="clojure">
user=> (def my-map {:a 1 :b 2})
#'user/my-map

user=> (assoc my-map :c 3)
{:a 1, :c 3, :b 2}

user=> (dissoc my-map :a)
{:b 2}

user=> my-map
{:a 1, :b 2}
  </code></pre>
</section>

</section>
<section>
<section id="sec-36" >

<h2>A brief tour of clojure.core</h2>
<p>
Working with maps:
</p>

  <pre><code data-trim class="clojure">
user=> (def my-map {:a 1 
                    :b 2 
                    :c {:d 4 
                        :e 5}})
#'user/my-map

user=> (keys my-map)
(:a :c :b)

user=> (vals my-map)
(1 {:d 4, :e 5} 2)

user=> (assoc-in my-map [:c :f] 6)
{:a 1, :c {:f 6, :d 4, :e 5}, :b 2}
  </code></pre>
</section>

</section>
<section>
<section id="sec-37" >

<h2>Vector functions</h2>
  <pre><code data-trim class="clojure">
user=> (def my-coll [2 3 1 5 6 4 0])
#'user/my-coll

user=> (first my-coll)
2

user=> (second my-coll)
3

user=> (nth my-coll 4)
6

user=> (conj my-coll 7)
[2 3 1 5 6 4 0 7]

user=> my-coll
[2 3 1 5 6 4 0]
  </code></pre>
</section>

</section>
<section>
<section id="sec-38" >

<h2>Vector functions</h2>
  <pre><code data-trim class="clojure">
user=> (def my-coll [2 3 1 5 6 4 0])
#'user/my-coll

user=> (sort my-coll)
(0 1 2 3 4 5 6)

user=> (interpose -1 my-coll)
(2 -1 3 -1 1 -1 5 -1 6 -1 4 -1 0)

user=> (zipmap [:a :b :c :d :e :f] my-coll)
{:f 4, :e 6, :d 5, :c 1, :b 3, :a 2}

user=> (frequencies "Hello world!")
{\space 1, \! 1, \d 1, \e 1, \H 1, \l 3, \o 2, \r 1, \w 1}
  </code></pre>
<p>
See also: concat, interleave, cons, last, butlast
</p>
</section>
</section>
<section>
<section id="sec-39" >

<h2>Sheer laziness</h2>
<p>
While Clojure is technically eager by default, most of the functions on collections operate lazily:
</p>
  <pre><code data-trim class="clojure">
user=> (def my-coll [0 1 2 3 4 5 6])
#'user/my-coll

user=> (take 3 my-coll)
(0 1 2)

user=> (drop 2 my-coll)
(2 3 4 5 6)

user=> (partition 3 my-coll)
((0 1 2) (3 4 5))

user=> (partition-all 3 my-coll)
((0 1 2) (3 4 5) (6))

user=> (split-at 3 my-coll)
[(0 1 2) (3 4 5 6)]

user=> (range)
;; good luck with this one! (cancel with Ctrl-c)

user=> (range 5)
(0 1 2 3 4)

user=> (take 5 (range))
(0 1 2 3 4)
  </code></pre>
</section>

</section>
<section>
<section id="sec-40" >

<h2>Higher order functions</h2>
<p>
Functions that accept or return functions
</p>

  <pre><code data-trim class="clojure">
user=> (def names [{:forename "Henry" :surname "Garner"}
                   {:forename "James" :surname "Henderson"}])
#'user/names

user=> (defn full-name [{:keys [forename surname]}]
         (str forename " " surname))
#'user/full-name

user=> (full-name (first names))
"Henry Garner"

user=> (map full-name names)
["Henry Garner" "James Henderson"]

  </code></pre>
</section>

</section>
<section>
<section id="sec-41" >

<h2>Anonymous Functions</h2>
<p>
Used where you have a case for a single-use function that doesn't warrant a name.
</p>

  <pre><code data-trim class="clojure">
user=> (def names [{:forename "Henry" :surname "Garner"}
                   {:forename "James" :surname "Henderson"}])
#'user/names

user=> (defn full-name [forename surname]
         (str forename " " surname))
#'user/full-name

user=> (map (fn [x] (full-name (:forename x) (:surname x))) names)

;; Equivalent to

user=> (map #(full-name (:forename %) (:surname %)) names)
  </code></pre>
</section>

</section>
<section>
<section id="sec-42" >

<h2>Anonymous function arities</h2>
<p>
You can refer to multiple args by %1, %2, &#x2026;
</p>
  <pre><code data-trim class="clojure">

(fn [x y] (+ x y))

;; Equivalent to

#(+ %1 %2)
  </code></pre>
</section>
</section>
<section>
<section id="sec-43" >

<h2>Other higher-order functions</h2>
<p>
Higher order functions can make use of functions.
</p>

  <pre><code data-trim class="clojure">
user=> (update-in {:name "Henry" :age 30} [:age] inc)
{:name "Henry" :age 31}
  </code></pre>
</section>

</section>
<section>
<section id="sec-44" >

<h2>Sequence-Sequence higher order functions</h2>
  <pre><code data-trim class="clojure">
user=> (map inc [1 2 3 4])
(2 3 4 5)

user=> (filter even? [1 2 3 4 5 6])
(2 4 6)

user=> (sort-by count ["bb" "aaa" "c"]
("c" "bb" "aaa")

user=> (sort-by first > [[1 2] [2 2] [3 3]])  
([3 3] [2 2] [1 2])
  </code></pre>
<p>
See also: mapcat, remove, partition-by
</p>
</section>
</section>
